{"about_desc":"Esu baigęs 9 mėnesių “JavaScript from Scratch” kursus SDA akademijoje ir toliau mokausi programavimo savarankiškai. Šiuo metu gilinuosi į \"React\" biblioteką ir \"Next.js\" sistemą. Taip pat jau daug metų laisvalaikiu kuriu internetines svetaines įvairioms įmonėms. Tikiu, kad jau turiu reikiamus pagrindus reikalingus šiai specialybei. Greitai mokausi ir įsisavinu naują informaciją, tad jei dar ir trūksta kokių žinių - tai ne problema.Programavimo įgūdžiai","about_intro":"Sveiki, papasakosiu šiek tiek apie save...","about_title":"Apie mane","additional_information":"Papildoma informacija","additional_information_desc":"Vairuotojo pažymėjimas, B kategorija nuo 2010 m. Nuosavas automobilis.","ap_company":"„Atostogų parkas“, Kretingos r., Lietuva.","ap_li1":"Komandos formavimas, darbuotojų atrinkimas darbo pokalbių metu, vadovavimas komandai, darbų paskirstymas;","ap_li2":"Adwords kampanijų rengimas ir optimizavimas;","ap_li3":"Atostoguparkas.lt ir naturatermospa.com svetainių priežiūra. Naujos internetinės svetainės palangospadelis.lt kūrimas, Google Analytics ataskaitų rengimas. Naujų IT sistemų analizė ir derinimas;","ap_li4":"Atsakomybė už visą įmonės skleidžiamą reklamą, jos teisingumą, terminus, platinimą, darbuotojų informavimą ir atsakomybės bei darbų paskirstymą;","ap_li5":"Rinkodarinių planų ruošimas ir įgyvendinimas: nuo rinkos analizės iki plano įvykdymo, stebėjimo ir ataskaitų ruošimo;","ap_li6":"Darbas su maketavimo ir vaizdo kūrimo programomis: Adobe Photoshop, Illustrator, After Effect ir Premiere PRO;","ap_li7":"Įmonės socialinių tinklų valdymas: priežiūra, reklama, konkursai ir sekėjų didinimas;","ap_li8":"Dalyvavimas parodose: registracija ir dokumentų tvarkymas, vietos išrinkimas, stendo parengimas, visų reklaminių ir informacinių lankstinukų paruošimas, įmonės reprezentavimas parodos metu, ataskaitos ruošimas;","ap_title":"Marketingo specialistas","certificate_link":"Sertifikato nuoroda","contacts_desc":"Jei turite papildomų klausimų ar pasiūlymų – susisiekite su manimi.","contacts_title":"Kontaktai","course_company":"„UAB Akademia SDA“","course_li1":"HTML ir CSS pagrindai, išankstiniai CSS procesoriai, CSS ir RWD sistemos, išplėstinės HTML ir CSS funkcijos;","course_li2":"Programavimo pagrindai, darbo su dizainu pagrindai, struktūrinis JavaScript programavimas, objektinis JavaScript programavimas , išplėstiniai JavaScript elementai, JavaScript sistemos;","course_li3":"Dizaino modeliai ir geroji praktika, \"Frontend\" ir \"backend\" skirtumai, turinio valdymo sistemos, kūrimo įrankiai, testavimas;","course_li4":"Galutinis projektas su Angular sistema– svetainė, kurioje galite registruoti gedimus ir atnaujinti būseną iš „atviras“ į „gedimas tvarkomas“ arba „išspręstas“. Svetainėje taip pat yra prisijungimo funkcija su \"token\" pagrįsta autentifikacija, turinys rodomas pagal vartotojo vaidmenį, o administratoriai gali pridėti naujų vartotojų.","course_title":"“JavaScript from Scratch” kursai","degree":"Ekonomikos bakalauras","design_skills":"Dizaino įgūdžiai","education":"Išsilavinimas","experience":"Patirtis","hobbies_desc":"Mėgstu sportą, žaidžiu tinklinį, padelį ir krepšinį. Domiuosi informacinėmis technologijomis, sveika gyvensena, skrydžių į kosmosą naujovėmis. Taip pat groju gitara.","hobbies_title":"Pomėgiai","intro1":"esu motyvuotas „Full-satck“ programuotojas kuriantis intuityvią ir gerą vartotojų patirtį su švariu ir struktūrizuotu kodu. ","intro2":"Savarankiškas, nuolat besidomintis programavimo naujovėmis ir nuolat besimokantis.","iv_company":"Individuali veikla","iv_desc":"Laisvalaikiu įmonėms kuriu internetines svetaines pagal individualią veiklą. Mano svetainė","iv_title":"Individuali veikla: Internetinių svetainių kūrimas","language1":"Lietuvių","language2":"Anglų","language3":"Vokiečių","languages":"Kalbos","more":"Plačiau...","php_li1":"„Wishlist“ funkcionalumą renginių svetainėje.","php_li2":"Automatinį email siuntimą apie artėjančius renginius, kurie pridėti į „Wishlist“.","php_li3":"Padelio žaidėjų reitingų lentelę su galimybe atnaujinti reitingus įkeliant CSV failą į svetainę.","php_li_head":"Panaudojęs šių kursų metu įgytas žinias suprogramavau:","php_title":"38 valandų PHP kursai „PHP for Beginners - CMS Project“","portfolio":"Darbų pavyzdžiai","portfolio2_desc":"Bandomoji svetainė panaudojant HTML, CSS ir JS žinias. Didžiausias dėmesys skirtas išbandyti CSS animacijas „transform“ su „transition“...","portfolio2_title":"Bandomoji svetainė","portfolio3_desc":"Klientei kurta Wordpress svetainė su papildomu PHP funkcionalumu...","portfolio3_title":"Svetainė su papildomu PHP funkcionalumu","portfolio4_desc":"Svetainė kurta su Wordpress, joje pateikiami klientams kurtų internetinių svetainių pavyzdžiai...","portfolio4_title":"Wordpress svetainių pavyzdžiai","portfolio5_desc":"Svetainė kurta panaudojant Next.js sistemą, nes norėjau praktikoje pritaikyti įgytas žinias.","portfolio5_title":"CV svetainė","portfolio7_desc":"Komandų sudarymo pagalbininkas su galimybe išsaugoti komandas ir sudaryti kitas nesikartojančias komandas...","portfolio7_title":"Atsitiktinių komandų generatorius","portfolio8_desc":"Projektas skirtas pritaikyti React kursų metu įgytas žinias...","portfolio8_title":"„Tenzi“ žaidimas","programming_skills":"Programavimo įgūdžiai","school":"Telšių Žemaitės gimnazija","school_degree":"Vidurinis išsilavinimas","university":"Vilniaus Universitetas, Kauno Humanitarinis Fakultetas","via_company":"„VIA UNICA“, Panevėžys, Lietuva","via_li1":"Atsakomybė už visą įmonės skleidžiamą reklamą, jos teisingumą, terminus, platinimą, darbuotojų informavimą.","via_li2":"Rinkodarinių idėjų generavimas ir įgyvendinimas: nuo informacijos rengimo ir apipavidalinimo iki pateikimo visuomenei ir rezultatų stebėjimo;","via_li3":"Darbas maketavimo ir video kūrimo programomis: Adobe Photoshop, Illustrator, After Effect ir Coreldraw;","via_li4":"Įmonės socialinių tinklų valdymas: priežiūra, reklama, konkursai ir sekėjų didinimas;","via_li5":"Dalyvavimas parodose: registracija ir dokumentų tvarkymas, vietos išrinkimas, stendo parengimas, visų reklaminių ir informacinių lankstinukų paruošimas, įmonės reprezentavimas parodos metu, ataskaitos ruošimas;","via_li6":"Naujų reklamavimosi galimybių paieška, geriausių variantų analizė, derinimas ir įgyvendinimas;","via_li7":"Žaidimų, konkursų, renginių organizavimas ir įgyvendinimas, ataskaitų rengimas;","via_li8":"Naujos internetinės svetainės kūrimas, SEO galimybių analizė, Google Analytics ataskaitų rengimas.","via_title":"Marketingo specialistas","welcome_msg":"Sveiki,"}