{"about_desc":"I have completed the 9-month  “JavaScript from Scratch” course at the SDA Academy and continue to learn programming on my own. I'm currently digging into the React library and the Next.js framework. I have also been creating websites for various companies in my spare time for many years. I believe that I already have the necessary foundations for this profession. I quickly learn and absorb new information, so if I still lack some knowledge, it's not a problem.","about_intro":"Hello, I will tell you a little about myself...","about_title":"About me","additional_information":"Additional information","additional_information_desc":"Driver's license, category B since 2010. Own car.","ap_company":"\"Atostogu parkas\", Kretinga district, Lithuania.","ap_li1":"Employee recruitment, team building, team management, work distribution;","ap_li2":"Preparation and optimization of Adwords campaigns;","ap_li3":"Atostoguparkas.lt and naturatermospa.com website maintenance. Creation of a new website palangospadelis.lt. Preparation of Google Analytics reports. Analysis and adjustment of new IT systems;","ap_li4":"Responsibility for all the advertisement spread by the company, its correctness, deadlines and distribution. Responsibility for informing employees about new offers and distributing responsibilities and tasks;","ap_li5":"Preparation and implementation of marketing plans: from market analysis to plan execution, monitoring and preparation of reports;","ap_li6":"Work with layout and video creation programs: Adobe Photoshop, Illustrator, After Effect and Premiere PRO;","ap_li7":"Management of the company's social networks: maintenance, advertising, contests and increasing followers;","ap_li8":"Participation in exhibitions: registration and document processing, choosing a place, preparation of the stand, preparation of all advertising and information brochures, representation of the company during the exhibition, preparation of the report;","ap_title":"Marketing specialist","certificate_link":"Certificate link","contacts_desc":"If you have any additional questions or offers, please contact me.","contacts_title":"Contacts","course_company":"„LTD Akademia SDA“","course_li1":"Basics of HTML and CSS, Preprocessors in CSS, Frameworks CSS and RWD, advanced features of HTML and CSS;","course_li2":"Basics of programming, Basics of working with designs, Structural programming in JavaScript, Object oriented programming in JavaScript, Advanced elements of JavaScript, JavaScript Frameworks;","course_li3":"Design patterns & Good practices, Differences between frontend and backend, CMS, Development tools, Testing;","course_li4":"Final project with Angular framework – a website where you can register failures and then update the status from “open” to “the fault is being handled” or “solved”. Website also has login feature with token based authentication, content is shown based on user role and administrators can add new users.","course_title":"\"JavaScript from Scratch\" courses","degree":"Bachelor of Economics","design_skills":"Design skills","education":"Education","experience":"Experience","hobbies_desc":"I like sports, I play volleyball, table tennis and basketball. I am interested in information technology, healthy lifestyle, innovations in space flights. I also play the guitar.","hobbies_title":"Hobbies","intro1":"I am highly motivated full-stack developer creating intuitive and sleek web experience with clean code.","intro2":"Passionate for programming, self-driven and always learning.\n","iv_company":"Individual activity","iv_desc":"In my free time, I create websites for companies based on individual activity. My website","iv_title":"Individual activity: Web development","language1":"Lithuanian","language2":"English","language3":"German","languages":"Languages","more":"Read more...","php_li1":"Wishlist functionality on the event website.","php_li2":"Automatic emails about upcoming events that had been added to the Wishlist.","php_li3":"Padel player ranking table with the ability to update rankings by uploading a CSV file to the website.","php_li_head":"Using what I learned during these courses, I programmed:","php_title":"38 hours PHP courses „PHP for Beginners - CMS Project“","portfolio":"Portfolio","portfolio2_desc":"Test website made using HTML, CSS and  \"JavaScript\" knowledge. The focus was on testing CSS animations with \"transform\" and \"transition\"...","portfolio2_title":"Test website","portfolio3_desc":"A “Wordpress” website with additional PHP functionality was created for the client...","portfolio3_title":"Website with additional PHP functionality","portfolio4_desc":"The site is built with Wordpress and contains examples of websites built for clients...","portfolio4_title":"Examples of Wordpress websites","portfolio5_desc":"The website was created using the Next.js framework, because I wanted to apply the acquired knowledge in practice.","portfolio5_title":"CV website","portfolio7_desc":"Team generation assistant with the ability to save teams and create other non-repeating teams...","portfolio7_title":"Random Team Generator","portfolio8_desc":"The project is designed to apply the knowledge gained during React courses...","portfolio8_title":"“Tenzi” game","programming_skills":"Programming skills","school":"Telsiu Zemaites gimnazija","school_degree":"Secondary education","university":"Vilnius University, Kaunas Faculty of Humanities","via_company":"\"VIA UNICA\", Panevezys, Lithuania","via_li1":"Responsibility for all advertising spread by the company, its correctness, deadlines, distribution, informing employees.","via_li2":"Generation and implementation of marketing ideas: from the preparation and design of information to presentation to the public and monitoring of results;","via_li3":"Work with design and video creation programs: Adobe Photoshop, Illustrator, After Effect and Coreldraw;","via_li4":"Management of the company's social networks: maintenance, advertising, contests and increasing followers;","via_li5":"Participation in exhibitions: registration and document processing, choosing a place, preparation of the stand, preparation of all advertising and information brochures, representation of the company during the exhibition, preparation of the report;","via_li6":"Search for new advertising opportunities, analysis, coordination and implementation of the best options;","via_li7":"Organization and implementation of games, contests, events, preparation of reports;","via_li8":"New website development, analysis of SEO possibilities, preparation of Google Analytics reports.","via_title":"Marketing specialist","welcome_msg":"Hello,"}